import type { BaseTranslation } from "../i18n-types";

const error: BaseTranslation = {
    accessLink: {
        title: "لینک دسترسی نادرست است",
        subTitle: "نقشه پیدا نشد. لطفاً لینک دسترسی خود را بررسی کنید.",
        details: "اگر اطلاعات بیشتری می‌خواهید، می‌توانید با مدیر تماس بگیرید یا با ما در تماس باشید: info@digi-work.ir",
    },
    connectionRejected: {
        title: "اتصال رد شد",
        subTitle: "شما نمی‌توانید به دنیا بپیوندید. بعداً دوباره تلاش کنید {error}.",
        details: "اگر اطلاعات بیشتری می‌خواهید، می‌توانید با مدیر تماس بگیرید یا با ما در تماس باشید: info@digi-work.ir",
    },
    connectionRetry: {
        unableConnect: "امکان اتصال به digi-work وجود ندارد. آیا به اینترنت متصل هستید؟",
    },
    errorDialog: {
        title: "خطا 😱",
        hasReportIssuesUrl: "اگر اطلاعات بیشتری می‌خواهید، می‌توانید با مدیر تماس بگیرید یا یک مشکل را در اینجا گزارش دهید:",
        noReportIssuesUrl: "اگر اطلاعات بیشتری می‌خواهید، می‌توانید با مدیر دنیا تماس بگیرید.",
        messageFAQ: "شما همچنین می‌توانید موارد زیر را بررسی کنید:",
        reload: "بارگذاری مجدد",
        close: "بستن",
    },
};

export default error;