import type { Translation } from "../i18n-types";

const translation: Translation = {
    modal: {
        selectCamera: "یک دوربین انتخاب کنید 📹",
        selectMicrophone: "یک میکروفون انتخاب کنید 🎙️",
        liveMessage: {
            startMegaphone: "شروع مگافون",
            stopMegaphone: "توقف مگافون",
            goingToStream: "شما در حال پخش زنده هستید",
            yourMicrophone: "میکروفون شما",
            yourCamera: "دوربین شما",
            yourScreen: "صفحه نمایش شما",
            title: "پیام زنده",
            button: "شروع پیام زنده",
            and: "و",
            toAll: "به همه شرکت‌کنندگان",
            confirm: "تأیید",
            cancel: "لغو",
            notice: '\n            پیام زنده یا "مگافون" به شما امکان می‌دهد یک پیام زنده با دوربین و میکروفون خود به همه افراد متصل در اتاق یا جهان ارسال کنید.\n\n            این پیام در گوشه پایین صفحه، مانند یک تماس ویدیویی یا گفتگوی حبابی نمایش داده می‌شود.\n\n            یک مثال از کاربرد پیام زنده: "سلام به همه، آیا کنفرانس را شروع کنیم؟ 🎉 آواتار من را تا منطقه کنفرانس دنبال کنید و برنامه ویدیو را باز کنید 🚀"\n            ',
            settings: "تنظیمات",
        },
        textMessage: {
            title: "پیام متنی",
            notice: '\n            پیام متنی به شما امکان می‌دهد یک پیام به همه افراد متصل در اتاق یا جهان ارسال کنید.\n\n            این پیام به عنوان یک پاپ‌آپ در بالای صفحه نمایش داده می‌شود و با یک صدا همراه خواهد بود تا مشخص شود اطلاعات قابل خواندن است.\n\n            یک مثال از پیام: "کنفرانس در اتاق 3 تا 2 دقیقه دیگر شروع می‌شود 🎉. می‌توانید به منطقه کنفرانس 3 بروید و برنامه ویدیو را باز کنید 🚀"\n            ',
            button: "ارسال یک پیام متنی",
            noAccess: "شما به این ویژگی دسترسی ندارید 😱 لطفاً با مدیر تماس بگیرید 🙏",
        },
        audioMessage: {
            title: "پیام صوتی",
            notice: '\n            پیام صوتی یک پیام از نوع "MP3، OGG..." است که به همه کاربران متصل در اتاق یا جهان ارسال می‌شود.\n\n            این پیام صوتی دانلود و برای همه افرادی که این اعلان را دریافت می‌کنند، پخش می‌شود.\n\n            یک پیام صوتی می‌تواند شامل یک ضبط صوتی باشد که نشان می‌دهد یک کنفرانس تا چند دقیقه دیگر شروع می‌شود.\n            ',
            button: "ارسال یک پیام صوتی",
            noAccess: "شما به این ویژگی دسترسی ندارید 😱 لطفاً با مدیر تماس بگیرید 🙏",
        },
        backToSelectCommunication: "Back to select communication",
        selectCommunication: "Select communication",
        title: "Global communication",
    },
};

export default translation;
