import type { Translation } from "../i18n-types";

const translation: Translation = {
    welcome: {
        title: "به {worldName} خوش آمدید! 🚀",
        description:
            "برای کاوش در دنیای مجازی که در آن می توانید در آن جا حرکت کنید، با دیگران چت کنید و در زمان واقعی همکاری کنید، آماده شوید. بیایید یک تور سریع داشته باشیم تا به شما در شروع کار کمک کنیم!",
        start: "برویم",
        skip: "رد شدن از آموزش",
    },
    movement: {
        title: "به اطراف حرکت کنید",
        descriptionDesktop:
            "از کلیدهای جهت‌نمای صفحه‌کلید یا WASD برای حرکت شخصیت خود در نقشه استفاده کنید. همچنین می توانید برای جابجایی کلیک راست کنید. اکنون حرکت کنید!",
        descriptionMobile: "برای جابجایی شخصیت خود از جوی استیک استفاده کنید یا روی نقشه ضربه بزنید. اکنون حرکت کنید!",
        next: "بعدی",
    },
    communication: {
        title: "حباب های ارتباطی",
        description:
            "وقتی به بازیکنان دیگر نزدیک می شوید، به طور خودکار وارد یک حباب ارتباطی می شوید. شما می توانید با دیگران در همان حباب چت کنید!",
        video: "./static/Videos/Meet.mp4",
        next: "متوجه شدم!",
    },
    lockBubble: {
        title: "مکالمه خود را قفل کنید",
        description:
            "برای جلوگیری از پیوستن دیگران به حباب مکالمه شما، روی دکمه قفل کلیک کنید. این برای بحث های خصوصی مفید است!",
        video: "./static/Videos/LockBubble.mp4",
        hint: "روی دکمه قفل برجسته کلیک کنید تا آن را امتحان کنید!",
        next: "بعدی",
    },
    screenSharing: {
        title: "صفحه نمایش خود را به اشتراک بگذارید",
        description: "صفحه نمایش خود را در حباب مکالمه خود با دیگران به اشتراک بگذارید. ایده آل برای ارائه و همکاری!",
        video: "./static/images/screensharing.mp4",
        hint: "برای شروع اشتراک‌گذاری، روی دکمه اشتراک‌گذاری صفحه برجسته کلیک کنید!",
        next: "بعدی",
    },
    pictureInPicture: {
        title: "تصویر در تصویر",
        description:
            "از تصویر در حالت تصویر استفاده کنید تا تماس‌های ویدیویی در حین پیمایش در نقشه قابل مشاهده باشد. عالی برای چند وظیفه ای!",
        video: "./static/Videos/PictureInPicture.mp4",
        hint: "روی دکمه برجسته PiP کلیک کنید تا فعال شود!",
        next: "بعدی",
    },
    complete: {
        title: "شما آماده اید! 🎉",
        description:
            "شما اصول اولیه {worldName} را یاد گرفته اید! با خیال راحت کاوش کنید، با افراد جدید ملاقات کنید و از آن لذت ببرید. در صورت نیاز همیشه می توانید از منو به کمک دسترسی داشته باشید.",
        finish: "شروع به کاوش کنید!",
    },
};

export default translation;
